results/rabbit/stage-100/payload-heavy/1000VUs/repeat-3/1000vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rabbit/rabbitTest.js
        output: json (./results/rabbit/stage-100/payload-heavy/1000VUs/repeat-3/1000vus.json)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 1087 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  0m00.9s/1m0s

running (0m01.9s), 1000/1000 VUs, 2979 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.9s/1m0s

running (0m02.9s), 1000/1000 VUs, 4892 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.9s/1m0s

running (0m03.9s), 1000/1000 VUs, 6769 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  0m03.9s/1m0s

running (0m03.8s), 1000/1000 VUs, 8674 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.9s/1m0s

running (0m04.8s), 1000/1000 VUs, 10576 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.9s/1m0s

running (0m05.8s), 1000/1000 VUs, 12496 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  0m06.9s/1m0s

running (0m06.8s), 1000/1000 VUs, 14368 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.9s/1m0s

running (0m07.8s), 1000/1000 VUs, 16292 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.9s/1m0s

running (0m08.8s), 1000/1000 VUs, 18192 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  0m09.9s/1m0s

running (0m09.8s), 1000/1000 VUs, 20121 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.9s/1m0s

running (0m10.8s), 1000/1000 VUs, 22021 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.9s/1m0s

running (0m11.8s), 1000/1000 VUs, 23928 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  0m12.9s/1m0s

running (0m12.8s), 1000/1000 VUs, 25865 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.9s/1m0s

running (0m13.8s), 1000/1000 VUs, 27751 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.9s/1m0s

running (0m14.8s), 1000/1000 VUs, 29664 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  0m15.9s/1m0s

running (0m15.8s), 1000/1000 VUs, 31547 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.9s/1m0s

running (0m16.8s), 1000/1000 VUs, 33446 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.9s/1m0s

running (0m17.8s), 1000/1000 VUs, 35346 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  0m18.9s/1m0s

running (0m18.8s), 1000/1000 VUs, 37264 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.9s/1m0s

running (0m19.8s), 1000/1000 VUs, 39165 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.9s/1m0s

running (0m20.8s), 1000/1000 VUs, 41033 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  0m21.9s/1m0s

running (0m21.8s), 1000/1000 VUs, 42960 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.9s/1m0s

running (0m22.8s), 1000/1000 VUs, 44851 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.9s/1m0s

running (0m23.8s), 1000/1000 VUs, 46772 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  0m24.9s/1m0s

running (0m24.8s), 1000/1000 VUs, 48649 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.9s/1m0s

running (0m25.8s), 1000/1000 VUs, 50544 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.9s/1m0s

running (0m26.8s), 1000/1000 VUs, 52444 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  0m27.9s/1m0s

running (0m27.8s), 1000/1000 VUs, 54340 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.9s/1m0s

running (0m28.8s), 1000/1000 VUs, 56247 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.9s/1m0s

running (0m29.8s), 1000/1000 VUs, 58145 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  0m30.9s/1m0s

running (0m30.8s), 1000/1000 VUs, 60034 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.9s/1m0s

running (0m31.8s), 1000/1000 VUs, 61911 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.9s/1m0s

running (0m32.8s), 1000/1000 VUs, 63808 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  0m33.9s/1m0s

running (0m32.6s), 1000/1000 VUs, 65685 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.9s/1m0s

running (0m33.6s), 1000/1000 VUs, 67591 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.9s/1m0s

running (0m34.6s), 1000/1000 VUs, 69482 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  0m36.9s/1m0s

running (0m35.6s), 1000/1000 VUs, 71390 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.9s/1m0s

running (0m36.6s), 1000/1000 VUs, 73290 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.9s/1m0s

running (0m37.6s), 1000/1000 VUs, 75181 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  0m39.9s/1m0s

running (0m38.6s), 1000/1000 VUs, 77092 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.9s/1m0s

running (0m39.6s), 1000/1000 VUs, 78995 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.9s/1m0s

running (0m40.6s), 1000/1000 VUs, 80872 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  0m42.9s/1m0s

running (0m41.6s), 1000/1000 VUs, 82770 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.9s/1m0s

running (0m42.6s), 1000/1000 VUs, 84692 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.9s/1m0s

running (0m43.6s), 1000/1000 VUs, 86600 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  0m45.9s/1m0s

running (0m44.6s), 1000/1000 VUs, 88516 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.9s/1m0s

running (0m45.6s), 1000/1000 VUs, 90389 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.9s/1m0s

running (0m46.6s), 1000/1000 VUs, 92321 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  0m48.9s/1m0s

running (0m47.6s), 1000/1000 VUs, 94233 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.9s/1m0s

running (0m48.6s), 1000/1000 VUs, 96134 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.9s/1m0s

running (0m49.6s), 1000/1000 VUs, 98042 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  0m51.9s/1m0s

running (0m50.6s), 1000/1000 VUs, 99951 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.9s/1m0s

running (0m51.6s), 1000/1000 VUs, 101859 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.9s/1m0s

running (0m52.6s), 1000/1000 VUs, 103797 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  0m54.9s/1m0s

running (0m53.6s), 1000/1000 VUs, 105709 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.9s/1m0s

running (0m54.6s), 1000/1000 VUs, 107633 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.9s/1m0s

running (0m55.6s), 1000/1000 VUs, 109534 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  0m57.9s/1m0s

running (0m56.6s), 1000/1000 VUs, 111390 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.9s/1m0s

running (0m57.6s), 1000/1000 VUs, 113249 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.9s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.08%  95 out of 114386
    benchmark_total_failure_rate...: 0.08%  95 out of 114386

    HTTP
    http_req_duration..............: avg=512.28ms min=-130836738ns med=524.1ms  max=1.59s p(90)=535.76ms p(95)=539.55ms
      { expected_response:true }...: avg=512.28ms min=-130836738ns med=524.1ms  max=1.59s p(90)=535.76ms p(95)=539.55ms
    http_req_failed................: 0.00%  0 out of 114386
    http_reqs......................: 114386 1964.101319/s

    EXECUTION
    iteration_duration.............: avg=526.01ms min=223.02ms     med=524.89ms max=1.72s p(90)=536.37ms p(95)=540.15ms
    iterations.....................: 114386 1964.101319/s
    vus............................: 1000   min=1000         max=1000
    vus_max........................: 1000   min=1000         max=1000

    NETWORK
    data_received..................: 29 MB  489 kB/s
    data_sent......................: 3.8 GB 65 MB/s



running (0m58.2s), 0000/1000 VUs, 114386 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s